## Ï†úÍ∞Ä ÍµêÏú° Ï§ëÏóê ÏûëÏÑ±ÌïòÎäî Î™®Îì† ÏΩîÎìúÎäî ÎÇòÏ§ëÏóê Í≥µÏú† ÎìúÎ¶ΩÎãàÎã§.

In [1]:
import numpy as np
import pandas as pd

In [ ]:
df_s = pd.DataFrame(dict(v1 = [100, 200, 300],
                         v2 = [400, 500, 600],
                         shape = ["A", "B", "C"]))
df_s

In [5]:
df_s.iloc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B

In [6]:
df_s.loc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [7]:
df_s.v1

0    100
1    200
2    300
Name: v1, dtype: int64

In [8]:
df_s.shape

(3, 3)

In [9]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [12]:
df_s.iloc[:, :-1] # Îí§ÏóêÏÑú Ï≤´ Î≤àÏß∏. drop last column

    v1   v2
0  100  400
1  200  500
2  300  600

In [15]:
df_s.loc[:, "v2":]

    v2 shape
0  400     A
1  500     B
2  600     C

In [16]:
df_s.loc[df_s["v1"] == 200, ]

    v1   v2 shape
1  200  500     B

In [17]:
df_s.loc[df_s["v1"] != 200, ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [18]:
df_s["v1"] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [20]:
~(df_s["v1"] == 200)

0     True
1    False
2     True
Name: v1, dtype: bool

In [21]:
# df_s.loc[df_s["v1"] != 200, ]
df_s.loc[~(df_s["v1"] == 200), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [22]:
df_s.loc[(df_s["v1"] == 200) & (df_s["v2"] == 600), ]

Empty DataFrame
Columns: [v1, v2, shape]
Index: []

In [23]:
df_s.loc[(df_s["v1"] == 200) | (df_s["v2"] == 600), ]

    v1   v2 shape
1  200  500     B
2  300  600     C

In [26]:
condi_1 = df_s["v1"] == 200
condi_2 = df_s["v2"] == 500
df_s.loc[condi_1 & condi_2, ]

    v1   v2 shape
1  200  500     B

In [27]:
df_s.loc[(df_s["shape"] == "A") | (df_s["shape"] == "C"), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [28]:
df_s.loc[df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [29]:
df_s.loc[~df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
1  200  500     B

In [30]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

,ÏßÄÏàòÎ™Ö,Ï¢ÖÍ∞Ä,ÎåÄÎπÑ,Îì±ÎùΩÎ•†,ÏãúÍ∞Ä,Í≥†Í∞Ä,Ï†ÄÍ∞Ä,Í±∞ÎûòÎüâ,Í±∞ÎûòÎåÄÍ∏à,ÏÉÅÏû•ÏãúÍ∞ÄÏ¥ùÏï°,ÎÇ†Ïßú
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503

In [ ]:
df_sub = df.loc[df["ÏßÄÏàòÎ™Ö"] == "KRX 300", ]
df_sub

In [39]:
df.loc[df["Ï¢ÖÍ∞Ä"] == df["Ï¢ÖÍ∞Ä"].max(), ["ÏßÄÏàòÎ™Ö", "Ï¢ÖÍ∞Ä", "ÎÇ†Ïßú"]]

         ÏßÄÏàòÎ™Ö        Ï¢ÖÍ∞Ä        ÎÇ†Ïßú
117  KTOP 30  11869.29  20210510

In [40]:
df["Ï¢ÖÍ∞Ä"].idxmax()

117

In [41]:
df.loc[117, ["ÏßÄÏàòÎ™Ö", "Ï¢ÖÍ∞Ä", "ÎÇ†Ïßú"]]

ÏßÄÏàòÎ™Ö     KTOP 30
Ï¢ÖÍ∞Ä     11869.29
ÎÇ†Ïßú     20210510
Name: 117, dtype: object

In [42]:
df.loc[df["Ï¢ÖÍ∞Ä"].idxmax(), ["ÏßÄÏàòÎ™Ö", "Ï¢ÖÍ∞Ä", "ÎÇ†Ïßú"]]

ÏßÄÏàòÎ™Ö     KTOP 30
Ï¢ÖÍ∞Ä     11869.29
ÎÇ†Ïßú     20210510
Name: 117, dtype: object

In [43]:
df.loc[[df["Ï¢ÖÍ∞Ä"].idxmax()], ["ÏßÄÏàòÎ™Ö", "Ï¢ÖÍ∞Ä", "ÎÇ†Ïßú"]]

         ÏßÄÏàòÎ™Ö        Ï¢ÖÍ∞Ä        ÎÇ†Ïßú
117  KTOP 30  11869.29  20210510

* Í≤∞Ï∏°Ïπò: https://datadoctorblog.com/2023/04/24/Py-Basic-Pandas-Missing/

In [47]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df_sub.info()

In [ ]:
df_sub.count() # Í±∞Ïùò ÏÇ¨Ïö©ÌïòÏßÄ ÏïäÏùå.

In [50]:
df_sub.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [51]:
df_sub.isna().sum() # üî•üî•

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [54]:
df_sub.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [55]:
df_sub1 = df_sub.loc[df_sub["Sepal.Width"].isna(), ]
df_sub1

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa

In [56]:
df_sub2 = df_sub.loc[df_sub["Sepal.Width"].notna(), ]
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [57]:
df_sub3 = df_sub.dropna()
df_sub3

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df_sub.loc[:, "Sepal.Width"] = df_sub["Sepal.Width"].fillna(-999)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())

In [ ]:
df_sub

In [63]:
df_sub2 = df.head().copy() # .copy() ÎòêÎäî .reset_index(drop = True) 
df_sub2.loc[:, "Sepal.Width"] = df_sub2["Sepal.Width"].fillna(-999)
df_sub2["Petal.Length"] = df_sub2["Petal.Length"].fillna(df_sub2["Petal.Length"].mean())
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1       -999.0           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df_sub3 = df.tail()
# df_sub3.reset_index()
df_sub3.reset_index(drop = True)

In [71]:
df_sub.set_index("Species").reset_index() # ÌäπÏ†ï Î≥ÄÏàòÎ•º Í∏∞Ï°¥ ÏúÑÏπòÏóê Í¥ÄÍ≥Ñ ÏóÜÏù¥ Í∞ÄÏû• ÏïûÏúºÎ°ú ÏòÆÍ∏∏ Ïàò ÏûàÏùå.

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1       -999.0           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

* ÏõêÏÜå/Ï°∞Ìï© ÏÑ∏Í∏∞: https://datadoctorblog.com/2023/04/04/Py-Basic-Pandas-Counting/
* crosstab(): https://datadoctorblog.com/2023/05/06/Py-Basic-Pandas-Crosstab/

In [ ]:
df = pd.read_csv("bike.csv")
df.head(1)

In [76]:
df["season"].unique()

array([1, 2, 3, 4])

In [77]:
df["season"].nunique() # number of ~

4

In [78]:
df["season"].drop_duplicates() # Îã®Î≥ÄÏàòÎäî Series, Îã§Ï§ëÎ≥ÄÏàòÎäî DataFrame

0       1
1323    2
2690    3
4055    4
Name: season, dtype: int64

In [80]:
# df.iloc[1321:1325, ]

In [ ]:
df["season"].value_counts()

In [82]:
df["season"].value_counts().sort_index()

season
1    2686
2    2733
3    2733
4    2734
Name: count, dtype: int64

In [83]:
df["season"].value_counts(normalize = True)

season
4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: proportion, dtype: float64

In [84]:
df[["season", "holiday"]].drop_duplicates()

      season  holiday
0          1        0
372        1        1
1323       2        0
1658       2        1
2690       3        0
2762       3        1
4055       4        0
4271       4        1

In [85]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

* .groupby(): https://datadoctorblog.com/2023/04/28/Py-Basic-Pandas-Groupby/

In [86]:
df = pd.read_csv("diamonds.csv")
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [87]:
df.groupby("cut")["price"].max()

cut
Fair         18574
Good         18788
Ideal        18806
Premium      18823
Very Good    18818
Name: price, dtype: int64

In [88]:
df_g1 = df.groupby("cut")["price"].max().reset_index()
df_g1

         cut  price
0       Fair  18574
1       Good  18788
2      Ideal  18806
3    Premium  18823
4  Very Good  18818

In [89]:
df.groupby("cut")[["price", "carat"]].max()

           price  carat
cut
Fair       18574   5.01
Good       18788   3.01
Ideal      18806   3.50
Premium    18823   4.01
Very Good  18818   4.00

In [90]:
df.groupby("cut")[["price", "carat"]].agg(["min", "max"])

          price        carat
            min    max   min   max
cut
Fair        337  18574  0.22  5.01
Good        327  18788  0.23  3.01
Ideal       326  18806  0.20  3.50
Premium     326  18823  0.20  4.01
Very Good   336  18818  0.20  4.00

In [93]:
df_g2 = df.groupby(["cut", "color"])["carat"].max().reset_index()
df_g2.head()

    cut color  carat
0  Fair     D   3.40
1  Fair     E   2.04
2  Fair     F   2.58
3  Fair     G   2.60
4  Fair     H   4.13

In [96]:
df_g3 = df.groupby("cut")[["price", "carat"]].agg({"price": "min", 
                                                   "carat": "max"}).reset_index() # üéØüéØüéØ ÏãúÌóò Í∏∞Ï∂ú ÏòàÏ†ú
df_g3.head()

         cut  price  carat
0       Fair    337   5.01
1       Good    327   3.01
2      Ideal    326   3.50
3    Premium    326   4.01
4  Very Good    336   4.00

* Î¨∏ÏûêÎç∞Ïù¥ÌÑ∞ Ìï∏Îì§ÎßÅ: https://datadoctorblog.com/2023/04/20/Py-Basic-Pandas-String-Data/

In [99]:
df_tx = pd.DataFrame(dict(v1 = [100, 200, 300],
                          v2 = ["abc", "aaa", "ccc"],
                          v3 = [123, "1234-5678", "010-1234-5678"]))
df_tx

    v1   v2             v3
0  100  abc            123
1  200  aaa      1234-5678
2  300  ccc  010-1234-5678

In [100]:
df_tx["v2"].replace("a", "üî•")

0    abc
1    aaa
2    ccc
Name: v2, dtype: object

In [101]:
df_tx["v2"].replace("aaa", "üî•")

0    abc
1      üî•
2    ccc
Name: v2, dtype: object

In [102]:
df_tx["v2"].replace({"aaa": "üî•", "ccc": "ü©µ"})

0    abc
1      üî•
2      ü©µ
Name: v2, dtype: object

In [103]:
df_tx["v2"].str.replace("a", "üî•")

0    üî•bc
1    üî•üî•üî•
2    ccc
Name: v2, dtype: object

In [104]:
df_tx["v2"].str.replace("aaa", "üî•")

0    abc
1      üî•
2    ccc
Name: v2, dtype: object

In [105]:
df_tx["v2"].str.contains("a")

0     True
1     True
2    False
Name: v2, dtype: bool

In [106]:
~df_tx["v2"].str.contains("a")

0    False
1    False
2     True
Name: v2, dtype: bool

In [ ]:
df_tx["v5"] = df_tx["v2"].str.replace("aaa", "üî•")
df_tx

In [118]:
df_tx["v3"].str.split("-")

0                  NaN
1         [1234, 5678]
2    [010, 1234, 5678]
Name: v3, dtype: object

In [121]:
df_tx["v4"] = df_tx["v3"].astype("str")
df_tx["v4"][0]

'123'

In [122]:
df_tx["v4"].str.split("-")

0                [123]
1         [1234, 5678]
2    [010, 1234, 5678]
Name: v4, dtype: object

In [123]:
df_tx["v4"].str.split("-").explode()

0     123
1    1234
1    5678
2     010
2    1234
2    5678
Name: v4, dtype: object

In [125]:
df_tx_v4 = df_tx["v4"].str.split("-", expand = True)
df_tx_v4

      0     1     2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [124]:
df_tx_v4_2 = df_tx_v4.add_prefix("v4_")
df_tx_v4_3 = df_tx_v4_2.fillna("ü•ó")
df_tx_v4_3

   v4_0  v4_1  v4_2
0   123     ü•ó     ü•ó
1  1234  5678     ü•ó
2   010  1234  5678

* ÏãúÍ∞ÑÎç∞Ïù¥ÌÑ∞ Ìï∏Îì§ÎßÅ: https://datadoctorblog.com/2023/04/14/Py-Basic-Pandas-Time-Data/

In [129]:
ser_t1 = pd.Series(["2077-12-18", "2077-12-19", "2077-12-20"])
ser_t2 = pd.Series(["2077ÎÖÑ 12Ïõî 18Ïùº", "2077ÎÖÑ 12Ïõî 19Ïùº", "2077ÎÖÑ 12Ïõî 20Ïùº"])
ser_t3 = pd.Series([20241218, 20241219, 20241220])
ser_t4 = pd.Series([1234, 2345, 3456])

In [130]:
pd.to_datetime(ser_t1)

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [132]:
# pd.to_datetime(ser_t2) # Error!!!

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [133]:
pd.to_datetime(ser_t2, format = "%YÎÖÑ %mÏõî %dÏùº")

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [134]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.020241218
1   1970-01-01 00:00:00.020241219
2   1970-01-01 00:00:00.020241220
dtype: datetime64[ns]

In [135]:
pd.to_datetime(ser_t3.astype("str"))

0   2024-12-18
1   2024-12-19
2   2024-12-20
dtype: datetime64[ns]

In [136]:
pd.to_datetime(ser_t4)

0   1970-01-01 00:00:00.000001234
1   1970-01-01 00:00:00.000002345
2   1970-01-01 00:00:00.000003456
dtype: datetime64[ns]

In [137]:
pd.to_datetime(ser_t4, origin = "2070-01-01", unit = "m")

0   2070-01-01 20:34:00
1   2070-01-02 15:05:00
2   2070-01-03 09:36:00
dtype: datetime64[ns]

In [142]:
df_bike = pd.read_csv("bike.csv")
df_dt2 = df_bike[["datetime"]].copy() # ÎåÄÍ¥ÑÌò∏ 2Í∞ú!! (DataFrame Í∞ùÏ≤¥ Ïú†Ìòï Ïú†ÏßÄ ÏúÑÌï®)

In [144]:
df_dt2["datetime"] = pd.to_datetime(df_dt2["datetime"])
df_dt2["date"  ] = df_dt2["datetime"].dt.date
df_dt2["yyyymm"] = df_dt2["datetime"].dt.strftime("%Y-%m") # Í∏∞Ï∂ú üéØ
df_dt2["year"  ] = df_dt2["datetime"].dt.year
df_dt2["month" ] = df_dt2["datetime"].dt.month
df_dt2["wday"  ] = df_dt2["datetime"].dt.weekday
df_dt2["wend"  ] = np.where(df_dt2["wday"] >= 5, 1, 0)
df_dt2["hour"  ] = df_dt2["datetime"].dt.hour
df_dt2["dt_s9h"] = df_dt2["datetime"] + pd.to_timedelta(9, unit = "h")

In [145]:
df_dt2.head(2)

,datetime,date,yyyymm,year,month,wday,wend,hour,dt_s9h
0,2011-01-01 00:00:00,2011-01-01,2011-01,2011,1,5,1,0,2011-01-01 09:00:00
1,2011-01-01 01:00:00,2011-01-01,2011-01,2011,1,5,1,1,2011-01-01 10:00:00

In [147]:
df_dt = pd.DataFrame(dict(date = ["2077-08-01", "2077-08-02", "2077-08-03"]))
df_dt["origin"] = "2077-01-01"
df_dt["date"  ] = pd.to_datetime(df_dt["date"])
df_dt["origin"] = pd.to_datetime(df_dt["origin"])
df_dt["diff"  ] = df_dt["date"] - df_dt["origin"]
df_dt["diff_d"] = df_dt["diff"].dt.days
df_dt

        date     origin     diff  diff_d
0 2077-08-01 2077-01-01 212 days     212
1 2077-08-02 2077-01-01 213 days     213
2 2077-08-03 2077-01-01 214 days     214

In [151]:
df_dt.dtypes

date       datetime64[ns]
origin     datetime64[ns]
diff      timedelta64[ns]
diff_d              int64
dtype: object

In [150]:
(df_dt["date"] - pd.to_datetime("2077-01-01")).dt.days

0    212
1    213
2    214
Name: date, dtype: int64

In [152]:
df_t = pd.DataFrame(dict(date = pd.date_range("2024-01-01", "2024-01-07"),
                         v = [100, 200, 300, np.nan, 500, 600, 700]))

df_t["v_s1"] = df_t["v"].shift(1)
df_t["v_s2"] = df_t["v"].shift(2)
df_t["v_sn1"] = df_t["v"].shift(-1)
df_t["v_fill_1"] = np.where(df_t["v"].isna(),
                            (df_t["v_s1"] + df_t["v_sn1"]) / 2,
                            df_t["v"])
df_t["v_fill_2"] = df_t["v"].interpolate()

In [153]:
df_t

        date      v   v_s1   v_s2  v_sn1  v_fill_1  v_fill_2
0 2024-01-01  100.0    NaN    NaN  200.0     100.0     100.0
1 2024-01-02  200.0  100.0    NaN  300.0     200.0     200.0
2 2024-01-03  300.0  200.0  100.0    NaN     300.0     300.0
3 2024-01-04    NaN  300.0  200.0  500.0     400.0     400.0
4 2024-01-05  500.0    NaN  300.0  600.0     500.0     500.0
5 2024-01-06  600.0  500.0    NaN  700.0     600.0     600.0
6 2024-01-07  700.0  600.0  500.0    NaN     700.0     700.0

* .melt(): https://datadoctorblog.com/2023/05/07/Py-Basic-Pandas-Melt/

In [158]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(3)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275
2,2017,1,3,66263,64233,63194,62461,62649,63396,65098,...,75576,75168,75791,75922,75469,73118,70769,68726,69593,71346

In [159]:
df_e_m1 = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"])
df_e_m1.head(2)

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067

In [160]:
df_e_m2 = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"], var_name = "HOUR", value_name = "LOAD")
df_e_m2.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067

In [ ]:
df_e_m2["h1"] = df_e_m2["HOUR"].str.replace("X", "").str.replace("HR", "")
# regex: Ï†ïÍ∑úÌëúÌòÑÏãù Regular Expression
df_e_m2["h2"] = df_e_m2["HOUR"].str.replace("X|HR", "", regex = True) # X ÎòêÎäî HR
df_e_m2["h3"] = df_e_m2["HOUR"].str.replace("[A-Z]", "", regex = True) # ÏòÅÎ¨∏ ÎåÄÎ¨∏Ïûê
df_e_m2["h4"] = df_e_m2["HOUR"].str.replace("[^0-9]", "", regex = True) # Ïà´ÏûêÎ•º Ï†úÏô∏Ìïú ÎÇòÎ®∏ÏßÄ
df_e_m2.head()

In [ ]:
df_e_m2.dtypes

In [165]:
df.head(2) # <- diamonds

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [173]:
df_g1 = df.groupby(["cut", "color"])["price"].mean().round(1).reset_index()
df_g2 = pd.crosstab(index = df["cut"], columns = df["color"], values = df["price"], aggfunc = "mean").round(1)
df_g3 = df.pivot_table(index = "cut", columns = "color", values = "price", aggfunc = "mean").round(1)

In [ ]:
df_g1.head()

In [ ]:
df_g2

In [176]:
df_g3

color           D       E       F       G       H       I       J
cut
Fair       4291.1  3682.3  3827.0  4239.3  5135.7  4685.4  4975.7
Good       3405.4  3423.6  3495.8  4123.5  4276.3  5078.5  4574.2
Ideal      2629.1  2597.6  3374.9  3720.7  3889.3  4452.0  4918.2
Premium    3631.3  3538.9  4324.9  4500.7  5216.7  5946.2  6294.6
Very Good  3470.5  3214.7  3778.8  3872.8  4535.4  5255.9  5103.5

In [177]:
df_bike = pd.read_csv("bike.csv")
df_b1 = df_bike.iloc[ :4, 4:7]
df_b2 = df_bike.iloc[1:5, 5:8]

In [187]:
df_bind1 = pd.concat([df_b1, df_b2])
df_bind1.isna().sum()

weather     4
temp        0
atemp       0
humidity    4
dtype: int64

In [ ]:
pd.concat([df_b1, df_b2], axis = 1)

In [ ]:
pd.concat([df_b1, df_b2.reset_index(drop = True).add_suffix("_y")], axis = 1)

In [189]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [190]:
df_sub1 = df.loc[df["cut"] != "Ideal", ]
df_sub2 = df.loc[~df["cut"].isin(["Premium", "Good"]), ]

In [192]:
df_sub1_g = df_sub1.groupby("cut")["price"].mean().reset_index()
df_sub2_g = df_sub2.groupby("cut")["price"].mean().reset_index()

In [201]:
df_join1 = pd.merge(df_sub1_g, df_sub2_g, on = "cut")
df_join1

         cut      price_x      price_y
0       Fair  4358.757764  4358.757764
1  Very Good  3981.759891  3981.759891

In [202]:
df_join2 = pd.merge(df_sub1_g, df_sub2_g, on = "cut", how = "left")
df_join2

         cut      price_x      price_y
0       Fair  4358.757764  4358.757764
1       Good  3928.864452          NaN
2    Premium  4584.257704          NaN
3  Very Good  3981.759891  3981.759891

In [203]:
df_join3 = pd.merge(df_sub1_g, df_sub2_g.rename(columns = {"price": "price2"}), on = "cut", how = "left")
df_join3

         cut        price       price2
0       Fair  4358.757764  4358.757764
1       Good  3928.864452          NaN
2    Premium  4584.257704          NaN
3  Very Good  3981.759891  3981.759891

In [ ]:
# Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóêÏÑú ÏÇ¨Ïö©ÌïòÎäî Í≤ÉÏùÄ x Ïóê Series Í∞ùÏ≤¥Í∞Ä Îì§Ïñ¥Í∞ê.
df.groupby("cut")["price"].agg(lambda x: round(x.mean(), 1) + 1000000)

In [210]:
def udf_1(x):
    return round(x.mean(), 1) + 1000000

In [211]:
df.groupby("cut")["price"].agg(udf_1)

cut
Fair         1004358.8
Good         1003928.9
Ideal        1003457.5
Premium      1004584.3
Very Good    1003981.8
Name: price, dtype: float64

In [212]:
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [214]:
df["clarity"].unique()

array(['SI2', 'SI1', 'VS1', 'VS2', 'VVS2', 'VVS1', 'I1', 'IF'],
      dtype=object)

In [215]:
df_s = df.loc[df["clarity"].str.contains("^S"), ] # SÎ°ú ÏãúÏûëÌïòÎäî.
df_s.head()

    carat        cut color clarity  depth  table  price     x     y     z
0    0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1    0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
4    0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
7    0.26  Very Good     H     SI1   61.9   55.0    337  4.07  4.11  2.53
10   0.30       Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73